/*REXX*/
/*This program is intended to solve the Advent of Code*/
/*2023 Challange: Day 2 Part 1*/

HLQ=userid()
inMember=HLQ||'.'||'DAY2.REXX(input1)'
red=12
green=13
blue=14
Game.='possible'
TotalPossible=0

/* read in input*/
"Alloc FI(INDD) DA('"inMember"') SHR"
"EXECIO * DISKR INDD (STEM input. FINIS"

/*For each record, seperate the id number from the cube values*/
/*then seperate the cube values from each game and compare with MaxCubes */
/*to see if that game is possible or impossible*/
do GameIndex=1 to input.0 by 1
    parse value input.GameIndex with GameName GameNumber BoxList
    do until BoxList=""
        /* Iterate through BoxList, separating 1-3 values depending on the */
        /* delimiting character. strip the delmiter when relevant */
        CubeCol.='EMPTY'
        do EntryIndex=1 to 3 by 1
            if BoxList\="" then
            do
                parse Value BoxList with boxNum.EntryIndex.val, 
                CubeCol.EntryIndex.val Boxlist
                
                /* if the ; delimiter is present, strip it and end the loop*/
                if pos(';',CubeCol.EntryIndex.val) > 0 then
                do
                    CubeCol.EntryIndex.val=strip(CubeCol.EntryIndex.val,,';')
                    currentColor=CubeCol.EntryIndex.val
                    call CheckColor        
                    EntryIndex=3
                end
                /* strip any possible , and continu the loop.*/
                else
                do
                    CubeCol.EntryIndex.val=strip(CubeCol.EntryIndex.val,,',')
                    currentColor=CubeCol.EntryIndex.val
                    call CheckColor 
                end              
            end
        end 
        
    end
    if Game.GameIndex='possible' then 
        do 
            TotalPossible=TotalPossible+GameIndex
        end
end
say 'Total Possible is:' TotalPossible




/*subroutine to evaluate if the number of a given color cubes exces the limit*/
CheckColor:
if currentColor='red' & boxNum.EntryIndex.val>red then Game.GameIndex,
='impossible'; 
if currentColor='green' & boxNum.EntryIndex.val>green then Game.GameIndex,
='impossible'; 
if currentColor='blue' & boxNum.EntryIndex.val>blue then Game.GameIndex,
='impossible';
return 0 


